In [ ]:
# Pandas

In [1]:
import numpy as np
import pandas as pd

In [4]:
s1 = pd.Series([1.0,2,3,4])
s1

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [5]:
s1 = pd.Series([1.0,2,3,4,'a'])
s1

0    1.0
1      2
2      3
3      4
4      a
dtype: object

In [9]:
s1 = pd.Series([1.0,2,3,4,'a'])
print(s1.index)
print(s1.dtype)

RangeIndex(start=0, stop=5, step=1)
object

In [11]:
s1.index=['가','나','다','라','마']
s1

가    1.0
나      2
다      3
라      4
마      a
dtype: object

In [14]:
s1.index=['서울','부산','대구','인천','대전']
s1['서울':'대구']
# 인덱스에 문자와 같은 값을 대입시키면 슬라이싱을 할 때 
# 정확히 작성한 만큼의 범위를 찾아준다.

서울    1.0
부산      2
대구      3
dtype: object

In [23]:
s1=[1.0,2,3,4]

In [35]:
names=['민준', '현우', '서연', '동현', '지현']
years=[2013, 2014,2015,2016,2015]
points=[105,1.7,3.5,2.4,2.9]
data={'names':names, 'years':years, 'points':points}
df=pd.DataFrame(data)
df

  names  years  points
0    민준   2013   105.0
1    현우   2014     1.7
2    서연   2015     3.5
3    동현   2016     2.4
4    지현   2015     2.9

In [31]:
data_list=[names,years,points]
print(data_list)
df1=pd.DataFrame(data_list)
df1

[['민준', '현우', '서연', '동현', '지현'], [2013, 2014, 2015, 2016, 2015], [105, 1.7, 3.5, 2.4, 2.9]]

      0     1     2     3     4
0    민준    현우    서연    동현    지현
1  2013  2014  2015  2016  2015
2   105   1.7   3.5   2.4   2.9

In [34]:
data2=zip(data_list[0], data_list[1], data_list[2])
df2=pd.DataFrame(data2, columns=['names', 'years', 'points'])
df2

# 데이터프레임에 데이터값은 꼭 들어가야 한다.

  names  years  points
0    민준   2013   105.0
1    현우   2014     1.7
2    서연   2015     3.5
3    동현   2016     2.4
4    지현   2015     2.9

In [37]:
df2=pd.DataFrame(data, columns=['years','names','points','penalty'],
                index = ['one', 'two', 'three', 'four', 'five'])
df2

       years names  points penalty
one     2013    민준   105.0     NaN
two     2014    현우     1.7     NaN
three   2015    서연     3.5     NaN
four    2016    동현     2.4     NaN
five    2015    지현     2.9     NaN

In [38]:
df2.describe()

             years      points
count     5.000000    5.000000
mean   2014.600000   23.100000
std       1.140175   45.788263
min    2013.000000    1.700000
25%    2014.000000    2.400000
50%    2015.000000    2.900000
75%    2015.000000    3.500000
max    2016.000000  105.000000

In [40]:
print(df['years'])
print(df.years)
print(df[['years', 'points']])
print(df[['years', 'points']])

0    2013
1    2014
2    2015
3    2016
4    2015
Name: years, dtype: int64
0    2013
1    2014
2    2015
3    2016
4    2015
Name: years, dtype: int64
   years  points
0   2013   105.0
1   2014     1.7
2   2015     3.5
3   2016     2.4
4   2015     2.9

TypeError: unsupported operand type(s) for |: 'str' and 'str'